fio_result/test_xvdo1/fio.randrw.128K.80.1.log
/dev/xvdo1: (g=0): rw=randrw, bs=128K-128K/128K-128K/128K-128K, ioengine=libaio, iodepth=8
fio-2.0.13
Starting 1 process

/dev/xvdo1: (groupid=0, jobs=1): err= 0: pid=3911: Fri Jun 27 04:15:10 2014
  read : io=1849.9MB, bw=63128KB/s, iops=493 , runt= 30007msec
    slat (usec): min=16 , max=126 , avg=20.32, stdev= 3.08
    clat (msec): min=1 , max=182 , avg=12.85, stdev=25.15
     lat (msec): min=1 , max=182 , avg=12.87, stdev=25.15
    clat percentiles (usec):
     |  1.00th=[ 1736],  5.00th=[ 2024], 10.00th=[ 2256], 20.00th=[ 2736],
     | 30.00th=[ 3280], 40.00th=[ 3824], 50.00th=[ 4576], 60.00th=[ 5792],
     | 70.00th=[ 7136], 80.00th=[ 7648], 90.00th=[17024], 95.00th=[89600],
     | 99.00th=[95744], 99.50th=[125440], 99.90th=[138240], 99.95th=[140288],
     | 99.99th=[168960]
    bw (KB/s)  : min=49459, max=108800, per=100.00%, avg=63510.37, stdev=15559.03
  write: io=479104KB, bw=15966KB/s, iops=124 , runt= 30007msec
    slat (usec): min=25 , max=191 , avg=48.80, stdev= 5.53
    clat (msec): min=2 , max=142 , avg=13.19, stdev=23.76
     lat (msec): min=2 , max=142 , avg=13.24, stdev=23.76
    clat percentiles (msec):
     |  1.00th=[    3],  5.00th=[    3], 10.00th=[    4], 20.00th=[    5],
     | 30.00th=[    5], 40.00th=[    6], 50.00th=[    7], 60.00th=[    8],
     | 70.00th=[    9], 80.00th=[    9], 90.00th=[   13], 95.00th=[   89],
     | 99.00th=[   97], 99.50th=[  103], 99.90th=[  139], 99.95th=[  141],
     | 99.99th=[  143]
    bw (KB/s)  : min=10472, max=30976, per=100.00%, avg=16097.95, stdev=4922.21
    lat (msec) : 2=3.51%, 4=34.35%, 10=48.67%, 20=4.13%, 50=0.72%
    lat (msec) : 100=7.95%, 250=0.67%
  cpu          : usr=0.25%, sys=2.22%, ctx=17014, majf=0, minf=24
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=14799/w=3743/d=0, short=r=0/w=0/d=0

Run status group 0 (all jobs):
   READ: io=1849.9MB, aggrb=63127KB/s, minb=63127KB/s, maxb=63127KB/s, mint=30007msec, maxt=30007msec
  WRITE: io=479104KB, aggrb=15966KB/s, minb=15966KB/s, maxb=15966KB/s, mint=30007msec, maxt=30007msec

Disk stats (read/write):
  xvdo: ios=44778/11191, merge=0/0, ticks=503109/126051, in_queue=629726, util=100.00%