fio_result/test_xvdo1/fio.randrw.512.80.1.log
/dev/xvdo1: (g=0): rw=randrw, bs=512-512/512-512/512-512, ioengine=libaio, iodepth=8
fio-2.0.13
Starting 1 process

/dev/xvdo1: (groupid=0, jobs=1): err= 0: pid=3684: Fri Jun 27 04:02:29 2014
  read : io=10602KB, bw=361250 B/s, iops=705 , runt= 30051msec
    slat (usec): min=7 , max=42 , avg=10.59, stdev= 1.83
    clat (usec): min=188 , max=119625 , avg=4196.45, stdev=11351.91
     lat (usec): min=199 , max=119636 , avg=4208.13, stdev=11351.87
    clat percentiles (usec):
     |  1.00th=[  219],  5.00th=[  245], 10.00th=[  266], 20.00th=[  306],
     | 30.00th=[  390], 40.00th=[ 1352], 50.00th=[ 2384], 60.00th=[ 2576],
     | 70.00th=[ 2608], 80.00th=[ 2608], 90.00th=[ 3696], 95.00th=[ 9024],
     | 99.00th=[59136], 99.50th=[63744], 99.90th=[82432], 99.95th=[115200],
     | 99.99th=[117248]
    bw (KB/s)  : min=  147, max= 1310, per=100.00%, avg=360.32, stdev=347.79
  write: io=2647.0KB, bw=90197 B/s, iops=176 , runt= 30051msec
    slat (usec): min=8 , max=66 , avg=11.66, stdev= 2.15
    clat (usec): min=419 , max=182234 , avg=28519.98, stdev=35908.50
     lat (usec): min=431 , max=182249 , avg=28532.73, stdev=35908.53
    clat percentiles (usec):
     |  1.00th=[  628],  5.00th=[ 1352], 10.00th=[ 2576], 20.00th=[ 2800],
     | 30.00th=[ 2800], 40.00th=[ 2864], 50.00th=[ 3024], 60.00th=[ 9280],
     | 70.00th=[58112], 80.00th=[66048], 90.00th=[71168], 95.00th=[111104],
     | 99.00th=[125440], 99.50th=[128512], 99.90th=[136192], 99.95th=[148480],
     | 99.99th=[181248]
    bw (KB/s)  : min=   41, max=  356, per=100.00%, avg=89.40, stdev=86.94
    lat (usec) : 250=4.83%, 500=22.49%, 750=2.27%, 1000=1.52%
    lat (msec) : 2=4.23%, 4=47.88%, 10=5.03%, 20=1.04%, 50=0.82%
    lat (msec) : 100=8.79%, 250=1.10%
  cpu          : usr=0.59%, sys=1.54%, ctx=22735, majf=0, minf=24
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=21203/w=5294/d=0, short=r=0/w=0/d=0

Run status group 0 (all jobs):
   READ: io=10601KB, aggrb=352KB/s, minb=352KB/s, maxb=352KB/s, mint=30051msec, maxt=30051msec
  WRITE: io=2647KB, aggrb=88KB/s, minb=88KB/s, maxb=88KB/s, mint=30051msec, maxt=30051msec

Disk stats (read/write):
  xvdo: ios=21718/5267, merge=0/0, ticks=89062/149538, in_queue=239138, util=99.92%