fio_result/test_xvdo1/fio.randwrite.256K.1.log
/dev/xvdo1: (g=0): rw=randwrite, bs=256K-256K/256K-256K/256K-256K, ioengine=libaio, iodepth=8
fio-2.0.13
Starting 1 process

/dev/xvdo1: (groupid=0, jobs=1): err= 0: pid=3537: Fri Jun 27 03:53:22 2014
  write: io=1850.0MB, bw=63050KB/s, iops=246 , runt= 30046msec
    slat (usec): min=31 , max=121 , avg=76.93, stdev= 3.91
    clat (msec): min=4 , max=85 , avg=32.39, stdev= 6.52
     lat (msec): min=4 , max=85 , avg=32.47, stdev= 6.52
    clat percentiles (usec):
     |  1.00th=[24192],  5.00th=[24960], 10.00th=[25472], 20.00th=[27008],
     | 30.00th=[28800], 40.00th=[29568], 50.00th=[30592], 60.00th=[32640],
     | 70.00th=[34048], 80.00th=[37120], 90.00th=[41216], 95.00th=[45312],
     | 99.00th=[52480], 99.50th=[58112], 99.90th=[66048], 99.95th=[72192],
     | 99.99th=[85504]
    bw (KB/s)  : min=54000, max=69864, per=100.00%, avg=63204.93, stdev=3536.29
    lat (msec) : 10=0.03%, 20=0.04%, 50=98.15%, 100=1.78%
  cpu          : usr=2.06%, sys=0.25%, ctx=7459, majf=0, minf=23
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=99.9%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=7400/d=0, short=r=0/w=0/d=0

Run status group 0 (all jobs):
  WRITE: io=1850.0MB, aggrb=63049KB/s, minb=63049KB/s, maxb=63049KB/s, mint=30046msec, maxt=30046msec

Disk stats (read/write):
  xvdo: ios=482/44227, merge=7/0, ticks=593/1367598, in_queue=1368834, util=100.00%